Backend/artillery/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 5
      name: Phase d'échauffement
    - duration: 15
      arrivalRate: 3
      rampTo: 12
      name: Phase de montée en charge
    - duration: 20
      arrivalRate: 5
      rampTo: 20
      name: Phase de charge haute
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
    expect: {}
  http:
    defaults:
      headers:
        Content-Type: "application/json"
        Accept: "application/json"
      cookies:
        jar: true
  apdex:
    threshold: 100
  ensure:
    thresholds:
      http.response_time.p99: 250
      http.response_time.p95: 100
      http.requests.completed: 95
  processor: "./processor.js"

scenarios:
  # Tests pour le contrôleur Products
  - name: "Test Récupération Produits"
    flow:
      - log: "Début du test de récupération de produits"
      - loop:
          - get:
              url: "/products/all"
              afterResponse: "logResponse"
              expect:
                - statusCode: 200
        count: 10

  - name: "Test Recherche Produit"
    flow:
      - log: "Début du test de recherche de produits"
      - get:
          url: "/products?page=1&searchQuery=cerisier"
          afterResponse: "logResponse"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/products/query?page=1&category=1&price=10-50"
          afterResponse: "logResponse"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/products/1"
          afterResponse: "logResponse"
          expect:
            - statusCode: [200, 404]

  # Tests pour le contrôleur Categories
  - name: "Test Récupération Catégories"
    flow:
      - log: "Début du test de récupération des catégories"
      - get:
          url: "/categories"
          afterResponse: "logResponse"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/categories/1"
          afterResponse: "logResponse"
          expect:
            - statusCode: [200, 404]

  # Tests pour le contrôleur Purchase
  - name: "Test Création Achat"
    flow:
      - log: "Début du test de création d'achat"
      - get:
          url: "/csrf-token"
          capture:
            - json: "$.token"
              as: "csrfToken"
          afterResponse: "logResponse"
      - post:
          url: "/login"
          headers:
            x-csrf-token: "{{ csrfToken }}"
          json:
            email: "test@test.com"
            password: "Sup3rm0tdepass3!"
          capture:
            - header: "set-cookie"
              as: "authCookie"
          afterResponse: "storeAuthCookie"
      - think: 1
      - post:
          url: "/purchases"
          headers:
            x-csrf-token: "{{ csrfToken }}"
            Cookie: "{{ authCookie }}"
          json:
            purchase:
              user_id: 2
              total: 50.99
              address: "123 Rue des Plantes"
              postalcode: "75000"
              city: "Paris"
              payment_method: "carte bancaire"
            purchase_products:
              [
                { product_id: 1, quantity: 2, total: 30.99 },
                { product_id: 2, quantity: 1, total: 20.00 },
              ]
          afterResponse: "logResponse"
          expect:
            - statusCode: [201, 400, 401, 403, 500]